/****************************************************************************/
/* 対象マイコン R8C/38A                                                     */
/* ﾌｧｲﾙ内容     ロータリエンコーダTypeSの動作確認                           */
/* バージョン   Ver.1.00                                                    */
/* Date         2015.10.15                                                  */
/* Copyright    株式会社日立ドキュメントソリューションズ                     */
/****************************************************************************/
/*
P3_2端子・P3_0端子とにロータリエンコーダTypeSの2相の出力信号を接続します。
モータドライブ基板をポート2に接続すると、モータドライブ基板のLED 2個が
ロータリエンコーダの回転に合わせて点滅します。
Tera Termを立ち上げ、ロータリエンコーダを回転させると、パルス数が出力されます。
*/

/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "printf_lib.h"                 /* printf使用ライブラリ         */

/*======================================*/
/* シンボル定義                         */
/*======================================*/

/*======================================*/
/* プロトタイプ宣言                     */
/*======================================*/
void init( void );

/************************************************************************/
/* メインプログラム                                                     */
/************************************************************************/
void main( void )
{
    int     i, ret;

    init();                             /* SFRの初期化                  */
    init_uart0_printf( SPEED_9600 );    /* UART0とprintf関連の初期化    */
    asm(" fset I ");                    /* 全体の割り込み許可           */

    printf( "\n\nEncoder Test Program\n\n" );

    while( 1 ) {
        p2_7 = ~p3_2;                   /* モータドライブ基板のLEDに出力*/
        p2_6 = ~p3_0;                   /* モータドライブ基板のLEDに出力*/

        printf( "P3_2=%1d P3_0=%1d Enc=%+06d(%04x)\r",
                                                p3_2, p3_0, trg, trg );
    }
}

/************************************************************************/
/* R8C/38A スペシャルファンクションレジスタ(SFR)の初期化                */
/************************************************************************/
void init( void )
{
    int i;

    /* クロックをXINクロック(20MHz)に変更 */
    prc0  = 1;                          /* プロテクト解除               */
    cm13  = 1;                          /* P4_6,P4_7をXIN-XOUT端子にする*/
    cm05  = 0;                          /* XINクロック発振              */
    for(i=0; i<50; i++ );               /* 安定するまで少し待つ(約10ms) */
    ocd2  = 0;                          /* システムクロックをXINにする  */
    prc0  = 0;                          /* プロテクトON                 */

    /* ポートの入出力設定 */
    prc2 = 1;                           /* PD0のプロテクト解除          */
    pd0 = 0x00;                         /*                              */
    pd1 = 0xd0;                         /* 5:RXD0 4:TXD0 3-0:DIP SW     */
    pd2 = 0xc0;                         /* 7:LED 6:LED                  */
    pd3 = 0x00;                         /*                              */
    p4  = 0x20;                         /* P4_5のLED:初期は点灯         */
    pd4 = 0xb8;                         /* 7:XOUT 6:XIN 5:LED 2:VREF    */
    pd5 = 0x00;                         /*                              */
    pd6 = 0x00;                         /*                              */
    pd7 = 0x00;                         /*                              */
    pd8 = 0x00;                         /*                              */
    pd9 = 0x00;                         /*                              */
    pur0 = 0x04;                        /* P1_3～P1_0のプルアップON     */

    /* タイマRG(位相計数モード)の設定 */
    //timsr = 0xc0;                       /* TRGCLKA,TRGCLKB端子割り当て  */
    //trgcntc = 0xff;                     /* 位相計数ﾓｰﾄﾞのｶｳﾝﾄ方法指定   */
    //trgmr = 0x82;                       /* TRGのカウント開始            */

   /* タイマRG タイマモード(両エッジでカウント)の設定　エンコーダのカウンタ設定 */

   //timsr = 0x40; /* TRGCLKA端子 P3_0に割り当てる (あっくん)*/
   timsr = 0x80; /* TRGCLKA端子 P3_2に割り当てる (井上くん)*/

   trgcr = 0x15; /* TRGCLKA端子の両エッジでカウント*/
   trgmr = 0x80; /* TRGのカウント開始 */

}

/************************************************************************/
/* end of file                                                          */
/************************************************************************/
